{
    "group_name": [
        "Prolock"
    ],
    "group_description": "PwndLocker is a ransomware that was observed in late 2019 and is reported to have been used to target businesses and local governments/cities. According to one source, ransom amounts demanded as part of PwndLocker activity range from $175k USD to $650k USD depending on the size of the network. PwndLocker attempts to disable a variety of Windows services so that their data can be encrypted. Various processes will also be targeted, such as web browsers and software related to security, backups, and databases. Shadow copies are cleared by the ransomware, and encryption of files occurs once the system has been prepared in this way. Executable files and those that are likely to be important for the system to continue to function appear to be skipped by the ransomware, and a large number of folders mostly related to Microsoft Windows system files are also ignored. As of March 2020, encrypted files have been observed with the added extensions of .key and .pwnd. Ransom notes are dropped in folders where encrypted files are found and also on the user's desktop.",
    "Victims count": 2,
    "First discovered victims": "2020-02-23",
    "Last discovered victim": "2020-04-25",
    "Avg Delay": "N/A",
    "Infostealer": "N/A",
    "Target": [
        {
            "Top 5 Activity Sectors": [
                {
                    "Government Facilities": 1,
                    "Financial": 1
                }
            ]
        },
        {
            "Top 5 Countries": [
                {
                    "United States": 2
                }
            ]
        }
    ],
    "victims": [
        {
            "v_name": "Diebold Nixdorf (ATM provider)",
            "Discovery Date": "2020-04-25",
            "Estimated Attack Date": "",
            "v_description": "N/A"
        },
        {
            "v_name": "LaSalle County Government",
            "Discovery Date": "2020-02-23",
            "Estimated Attack Date": "",
            "v_description": "N/A"
        }
    ]
}